# 记录各个交易所的品种

# 上期所，
# 小写字母，int类型日期
ex_sh = {
    ## 金属
    'cu': 20010101,
    'al': 20010101,
    'zn': 20010101,
    'pb': 20010101,
    'ni': 20010101,
    'sn': 20010101,  # 金属锡
    'au': 20010101,  # 黄金
    'ag': 20010101,
    'rb': 20010101,
    'wr': 20010101,  # 线材
    'hc': 20010101,  # 热轧卷板
    ## 能源化工
    'sc': 20010101,  # 原油
    'fu': 20010101,  # 原料油
    'bu': 20010101,  # 沥青
    'rb': 20010101,  # 橡胶
    'nr': 20010101,  # 20号胶
    'sp': 20010101  # 纸浆
}

# 大连期货交易所
ex_dl = {
    ## 农产品
    'm': 20010101,  # 豆粕
    'y': 20010101,  # 豆油
    'a': 20010101,  # 豆一
    'b': 20010101,  # 豆二
    'p': 20010101,  # 棕榈油
    'c': 20010101,  # 玉米
    'cs': 20010101,  # 玉米淀粉
    'jd': 20010101,  # 鸡蛋
    'rr': 20010101,  # 梗米
    'bb': 20010101,  # 胶合板
    'fb': 20010101,  # 纤维板
    ## 工业品
    'l': 20010101,  # 塑料
    'v': 20010101,  # PVC
    'pp': 20010101,  # 聚丙烯
    'eg': 20010101,  # 乙二醇
    'j': 20010101,  # 焦炭
    'jm': 20010101,  # 焦煤
    'i': 20010101,  # 铁矿石
    'eb': 20010101,  # 苯乙烯
}

# 郑州期货交易所
ex_zz = {
    ## 农产品
    'sr': 20010101,  # 白糖
    'cf': 20010101,  # 郑棉
    # 'wh':20010101, # 强麦，没交易量
    # 'pm':20010101, # 普麦，没交易量
    # 'ri':20010101, # 早籼稻，没交易量
    # 'lr':20010101, # 没交易量
    # 'jr':20010101, # 没交易量
    # 'rs':20010101, # 没交易量
    'oi': 20010101,  # 菜油
    'rm': 20010101,  # 菜粕
    'ap': 20010101,  # 苹果
    'cj': 20010101,  # 红枣
    'cy': 20010101,  # 棉纱

    ## 非农产品
    'zc': 20010101,  # 动力煤
    'fg': 20010101,  # 玻璃
    'ta': 20010101,  # PTA
    'ma': 20010101,  # 甲醇
    # 'sf':20010101, # 硅铁 数据有问题
    'sm': 20010101,  # 硅锰
    'ur': 20010101,  # 尿素
    'sa': 20010101,  # 纯碱 ，201912刚上市
}

## 中金所
ex_cf = {
    'if': 20010101,  # hs300
    'ic': 20010101,  # sz50
    'ih': 20010101,  # zz500
    'tf': 20010101,  # 5年国债，国债期货成交量最低
    't': 20010101,  # 10年国债，国债期货成交量次之
    'ts': 20010101  # 2年国债，国债期货成交量最猛
}

if __name__ == '__main__':
    print(len(ex_sh))
    print(len(ex_dl))
    print(len(ex_zz))
    print(len(ex_cf))
